# RasterSymbolPagenumber Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RasterSymbolPagenumber Property
ParameterTypeId Class See Also
---
"Page Number"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RasterSymbolPagenumber { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RasterSymbolPagenumber As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RasterSymbolPagenumber {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace